Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Infineon/XMC1400_series/Include/XMC1403.h
/* -------------------------------  LEDTS0_GLOBCTL  ------------------------------- */
#define LEDTS0_GLOBCTL_TS_EN_Pos              (0UL)                     /*!< LEDTS0 GLOBCTL: TS_EN (Bit 0)                               */
#define LEDTS0_GLOBCTL_TS_EN_Msk              (0x1UL)                   /*!< LEDTS0 GLOBCTL: TS_EN (Bitfield-Mask: 0x01)                 */
#define LEDTS0_GLOBCTL_LD_EN_Pos              (1UL)                     /*!< LEDTS0 GLOBCTL: LD_EN (Bit 1)                               */
#define LEDTS0_GLOBCTL_LD_EN_Msk              (0x2UL)                   /*!< LEDTS0 GLOBCTL: LD_EN (Bitfield-Mask: 0x01)                 */
#define LEDTS0_GLOBCTL_CMTR_Pos               (2UL)                     /*!< LEDTS0 GLOBCTL: CMTR (Bit 2)                                */
#define LEDTS0_GLOBCTL_CMTR_Msk               (0x4UL)                   /*!< LEDTS0 GLOBCTL: CMTR (Bitfield-Mask: 0x01)                  */
#define LEDTS0_GLOBCTL_ENSYNC_Pos             (3UL)                     /*!< LEDTS0 GLOBCTL: ENSYNC (Bit 3)                              */
#define LEDTS0_GLOBCTL_ENSYNC_Msk             (0x8UL)                   /*!< LEDTS0 GLOBCTL: ENSYNC (Bitfield-Mask: 0x01)                */
#define LEDTS0_GLOBCTL_SUSCFG_Pos             (8UL)                     /*!< LEDTS0 GLOBCTL: SUSCFG (Bit 8)                              */
#define LEDTS0_GLOBCTL_SUSCFG_Msk             (0x100UL)                 /*!< LEDTS0 GLOBCTL: SUSCFG (Bitfield-Mask: 0x01)                */
#define LEDTS0_GLOBCTL_MASKVAL_Pos            (9UL)                     /*!< LEDTS0 GLOBCTL: MASKVAL (Bit 9)                             */
#define LEDTS0_GLOBCTL_MASKVAL_Msk            (0xe00UL)                 /*!< LEDTS0 GLOBCTL: MASKVAL (Bitfield-Mask: 0x07)               */
#define LEDTS0_GLOBCTL_FENVAL_Pos             (12UL)                    /*!< LEDTS0 GLOBCTL: FENVAL (Bit 12)                             */
#define LEDTS0_GLOBCTL_FENVAL_Msk             (0x1000UL)                /*!< LEDTS0 GLOBCTL: FENVAL (Bitfield-Mask: 0x01)                */
#define LEDTS0_GLOBCTL_ITS_EN_Pos             (13UL)                    /*!< LEDTS0 GLOBCTL: ITS_EN (Bit 13)                             */
#define LEDTS0_GLOBCTL_ITS_EN_Msk             (0x2000UL)                /*!< LEDTS0 GLOBCTL: ITS_EN (Bitfield-Mask: 0x01)                */
#define LEDTS0_GLOBCTL_ITF_EN_Pos             (14UL)                    /*!< LEDTS0 GLOBCTL: ITF_EN (Bit 14)                             */
#define LEDTS0_GLOBCTL_ITF_EN_Msk             (0x4000UL)                /*!< LEDTS0 GLOBCTL: ITF_EN (Bitfield-Mask: 0x01)                */
#define LEDTS0_GLOBCTL_ITP_EN_Pos             (15UL)                    /*!< LEDTS0 GLOBCTL: ITP_EN (Bit 15)                             */
#define LEDTS0_GLOBCTL_ITP_EN_Msk             (0x8000UL)                /*!< LEDTS0 GLOBCTL: ITP_EN (Bitfield-Mask: 0x01)                */
#define LEDTS0_GLOBCTL_CLK_PS_Pos             (16UL)                    /*!< LEDTS0 GLOBCTL: CLK_PS (Bit 16)                             */
#define LEDTS0_GLOBCTL_CLK_PS_Msk             (0xffff0000UL)            /*!< LEDTS0 GLOBCTL: CLK_PS (Bitfield-Mask: 0xffff)              */

/* --------------------------------  LEDTS0_FNCTL  -------------------------------- */
#define LEDTS0_FNCTL_PADT_Pos                 (0UL)                     /*!< LEDTS0 FNCTL: PADT (Bit 0)                                  */
#define LEDTS0_FNCTL_PADT_Msk                 (0x7UL)                   /*!< LEDTS0 FNCTL: PADT (Bitfield-Mask: 0x07)                    */
#define LEDTS0_FNCTL_PADTSW_Pos               (3UL)                     /*!< LEDTS0 FNCTL: PADTSW (Bit 3)                                */
#define LEDTS0_FNCTL_PADTSW_Msk               (0x8UL)                   /*!< LEDTS0 FNCTL: PADTSW (Bitfield-Mask: 0x01)                  */
#define LEDTS0_FNCTL_EPULL_Pos                (4UL)                     /*!< LEDTS0 FNCTL: EPULL (Bit 4)                                 */
#define LEDTS0_FNCTL_EPULL_Msk                (0x10UL)                  /*!< LEDTS0 FNCTL: EPULL (Bitfield-Mask: 0x01)                   */
#define LEDTS0_FNCTL_FNCOL_Pos                (5UL)                     /*!< LEDTS0 FNCTL: FNCOL (Bit 5)                                 */
#define LEDTS0_FNCTL_FNCOL_Msk                (0xe0UL)                  /*!< LEDTS0 FNCTL: FNCOL (Bitfield-Mask: 0x07)                   */
#define LEDTS0_FNCTL_ACCCNT_Pos               (16UL)                    /*!< LEDTS0 FNCTL: ACCCNT (Bit 16)                               */
#define LEDTS0_FNCTL_ACCCNT_Msk               (0xf0000UL)               /*!< LEDTS0 FNCTL: ACCCNT (Bitfield-Mask: 0x0f)                  */
#define LEDTS0_FNCTL_TSCCMP_Pos               (20UL)                    /*!< LEDTS0 FNCTL: TSCCMP (Bit 20)                               */
#define LEDTS0_FNCTL_TSCCMP_Msk               (0x100000UL)              /*!< LEDTS0 FNCTL: TSCCMP (Bitfield-Mask: 0x01)                  */
#define LEDTS0_FNCTL_TSOEXT_Pos               (21UL)                    /*!< LEDTS0 FNCTL: TSOEXT (Bit 21)                               */
#define LEDTS0_FNCTL_TSOEXT_Msk               (0x600000UL)              /*!< LEDTS0 FNCTL: TSOEXT (Bitfield-Mask: 0x03)                  */
#define LEDTS0_FNCTL_TSCTRR_Pos               (23UL)                    /*!< LEDTS0 FNCTL: TSCTRR (Bit 23)                               */
#define LEDTS0_FNCTL_TSCTRR_Msk               (0x800000UL)              /*!< LEDTS0 FNCTL: TSCTRR (Bitfield-Mask: 0x01)                  */
#define LEDTS0_FNCTL_TSCTRSAT_Pos             (24UL)                    /*!< LEDTS0 FNCTL: TSCTRSAT (Bit 24)                             */
#define LEDTS0_FNCTL_TSCTRSAT_Msk             (0x1000000UL)             /*!< LEDTS0 FNCTL: TSCTRSAT (Bitfield-Mask: 0x01)                */
#define LEDTS0_FNCTL_NR_TSIN_Pos              (25UL)                    /*!< LEDTS0 FNCTL: NR_TSIN (Bit 25)                              */
#define LEDTS0_FNCTL_NR_TSIN_Msk              (0xe000000UL)             /*!< LEDTS0 FNCTL: NR_TSIN (Bitfield-Mask: 0x07)                 */
#define LEDTS0_FNCTL_COLLEV_Pos               (28UL)                    /*!< LEDTS0 FNCTL: COLLEV (Bit 28)                               */
#define LEDTS0_FNCTL_COLLEV_Msk               (0x10000000UL)            /*!< LEDTS0 FNCTL: COLLEV (Bitfield-Mask: 0x01)                  */
#define LEDTS0_FNCTL_NR_LEDCOL_Pos            (29UL)                    /*!< LEDTS0 FNCTL: NR_LEDCOL (Bit 29)                            */
#define LEDTS0_FNCTL_NR_LEDCOL_Msk            (0xe0000000UL)            /*!< LEDTS0 FNCTL: NR_LEDCOL (Bitfield-Mask: 0x07)               */

/* ---------------------------------  LEDTS0_EVFR  -------------------------------- */
#define LEDTS0_EVFR_TSF_Pos                   (0UL)                     /*!< LEDTS0 EVFR: TSF (Bit 0)                                    */
#define LEDTS0_EVFR_TSF_Msk                   (0x1UL)                   /*!< LEDTS0 EVFR: TSF (Bitfield-Mask: 0x01)                      */
#define LEDTS0_EVFR_TFF_Pos                   (1UL)                     /*!< LEDTS0 EVFR: TFF (Bit 1)                                    */
#define LEDTS0_EVFR_TFF_Msk                   (0x2UL)                   /*!< LEDTS0 EVFR: TFF (Bitfield-Mask: 0x01)                      */
#define LEDTS0_EVFR_TPF_Pos                   (2UL)                     /*!< LEDTS0 EVFR: TPF (Bit 2)                                    */
#define LEDTS0_EVFR_TPF_Msk                   (0x4UL)                   /*!< LEDTS0 EVFR: TPF (Bitfield-Mask: 0x01)                      */
#define LEDTS0_EVFR_TSCTROVF_Pos              (3UL)                     /*!< LEDTS0 EVFR: TSCTROVF (Bit 3)                               */
#define LEDTS0_EVFR_TSCTROVF_Msk              (0x8UL)                   /*!< LEDTS0 EVFR: TSCTROVF (Bitfield-Mask: 0x01)                 */
#define LEDTS0_EVFR_CTSF_Pos                  (16UL)                    /*!< LEDTS0 EVFR: CTSF (Bit 16)                                  */
#define LEDTS0_EVFR_CTSF_Msk                  (0x10000UL)               /*!< LEDTS0 EVFR: CTSF (Bitfield-Mask: 0x01)                     */
#define LEDTS0_EVFR_CTFF_Pos                  (17UL)                    /*!< LEDTS0 EVFR: CTFF (Bit 17)                                  */
#define LEDTS0_EVFR_CTFF_Msk                  (0x20000UL)               /*!< LEDTS0 EVFR: CTFF (Bitfield-Mask: 0x01)                     */
#define LEDTS0_EVFR_CTPF_Pos                  (18UL)                    /*!< LEDTS0 EVFR: CTPF (Bit 18)                                  */
#define LEDTS0_EVFR_CTPF_Msk                  (0x40000UL)               /*!< LEDTS0 EVFR: CTPF (Bitfield-Mask: 0x01)                     */

/* --------------------------------  LEDTS0_TSVAL  -------------------------------- */
#define LEDTS0_TSVAL_TSCTRVALR_Pos            (0UL)                     /*!< LEDTS0 TSVAL: TSCTRVALR (Bit 0)                             */
#define LEDTS0_TSVAL_TSCTRVALR_Msk            (0xffffUL)                /*!< LEDTS0 TSVAL: TSCTRVALR (Bitfield-Mask: 0xffff)             */
#define LEDTS0_TSVAL_TSCTRVAL_Pos             (16UL)                    /*!< LEDTS0 TSVAL: TSCTRVAL (Bit 16)                             */
#define LEDTS0_TSVAL_TSCTRVAL_Msk             (0xffff0000UL)            /*!< LEDTS0 TSVAL: TSCTRVAL (Bitfield-Mask: 0xffff)              */

/* --------------------------------  LEDTS0_LINE0  -------------------------------- */
#define LEDTS0_LINE0_LINE_0_Pos               (0UL)                     /*!< LEDTS0 LINE0: LINE_0 (Bit 0)                                */
#define LEDTS0_LINE0_LINE_0_Msk               (0xffUL)                  /*!< LEDTS0 LINE0: LINE_0 (Bitfield-Mask: 0xff)                  */
#define LEDTS0_LINE0_LINE_1_Pos               (8UL)                     /*!< LEDTS0 LINE0: LINE_1 (Bit 8)                                */
#define LEDTS0_LINE0_LINE_1_Msk               (0xff00UL)                /*!< LEDTS0 LINE0: LINE_1 (Bitfield-Mask: 0xff)                  */
#define LEDTS0_LINE0_LINE_2_Pos               (16UL)                    /*!< LEDTS0 LINE0: LINE_2 (Bit 16)                               */
#define LEDTS0_LINE0_LINE_2_Msk               (0xff0000UL)              /*!< LEDTS0 LINE0: LINE_2 (Bitfield-Mask: 0xff)                  */
#define LEDTS0_LINE0_LINE_3_Pos               (24UL)                    /*!< LEDTS0 LINE0: LINE_3 (Bit 24)                               */
#define LEDTS0_LINE0_LINE_3_Msk               (0xff000000UL)            /*!< LEDTS0 LINE0: LINE_3 (Bitfield-Mask: 0xff)                  */

/* --------------------------------  LEDTS0_LINE1  -------------------------------- */
#define LEDTS0_LINE1_LINE_4_Pos               (0UL)                     /*!< LEDTS0 LINE1: LINE_4 (Bit 0)                                */
#define LEDTS0_LINE1_LINE_4_Msk               (0xffUL)                  /*!< LEDTS0 LINE1: LINE_4 (Bitfield-Mask: 0xff)                  */
#define LEDTS0_LINE1_LINE_5_Pos               (8UL)                     /*!< LEDTS0 LINE1: LINE_5 (Bit 8)                                */
#define LEDTS0_LINE1_LINE_5_Msk               (0xff00UL)                /*!< LEDTS0 LINE1: LINE_5 (Bitfield-Mask: 0xff)                  */
#define LEDTS0_LINE1_LINE_6_Pos               (16UL)                    /*!< LEDTS0 LINE1: LINE_6 (Bit 16)                               */
#define LEDTS0_LINE1_LINE_6_Msk               (0xff0000UL)              /*!< LEDTS0 LINE1: LINE_6 (Bitfield-Mask: 0xff)                  */
#define LEDTS0_LINE1_LINE_A_Pos               (24UL)                    /*!< LEDTS0 LINE1: LINE_A (Bit 24)                               */
#define LEDTS0_LINE1_LINE_A_Msk               (0xff000000UL)            /*!< LEDTS0 LINE1: LINE_A (Bitfield-Mask: 0xff)                  */

/* --------------------------------  LEDTS0_LDCMP0  ------------------------------- */
#define LEDTS0_LDCMP0_CMP_LD0_Pos             (0UL)                     /*!< LEDTS0 LDCMP0: CMP_LD0 (Bit 0)                              */
#define LEDTS0_LDCMP0_CMP_LD0_Msk             (0xffUL)                  /*!< LEDTS0 LDCMP0: CMP_LD0 (Bitfield-Mask: 0xff)                */
#define LEDTS0_LDCMP0_CMP_LD1_Pos             (8UL)                     /*!< LEDTS0 LDCMP0: CMP_LD1 (Bit 8)                              */
#define LEDTS0_LDCMP0_CMP_LD1_Msk             (0xff00UL)                /*!< LEDTS0 LDCMP0: CMP_LD1 (Bitfield-Mask: 0xff)                */
#define LEDTS0_LDCMP0_CMP_LD2_Pos             (16UL)                    /*!< LEDTS0 LDCMP0: CMP_LD2 (Bit 16)                             */
#define LEDTS0_LDCMP0_CMP_LD2_Msk             (0xff0000UL)              /*!< LEDTS0 LDCMP0: CMP_LD2 (Bitfield-Mask: 0xff)                */
#define LEDTS0_LDCMP0_CMP_LD3_Pos             (24UL)                    /*!< LEDTS0 LDCMP0: CMP_LD3 (Bit 24)                             */
#define LEDTS0_LDCMP0_CMP_LD3_Msk             (0xff000000UL)            /*!< LEDTS0 LDCMP0: CMP_LD3 (Bitfield-Mask: 0xff)                */

/* --------------------------------  LEDTS0_LDCMP1  ------------------------------- */
#define LEDTS0_LDCMP1_CMP_LD4_Pos             (0UL)                     /*!< LEDTS0 LDCMP1: CMP_LD4 (Bit 0)                              */
#define LEDTS0_LDCMP1_CMP_LD4_Msk             (0xffUL)                  /*!< LEDTS0 LDCMP1: CMP_LD4 (Bitfield-Mask: 0xff)                */
#define LEDTS0_LDCMP1_CMP_LD5_Pos             (8UL)                     /*!< LEDTS0 LDCMP1: CMP_LD5 (Bit 8)                              */
#define LEDTS0_LDCMP1_CMP_LD5_Msk             (0xff00UL)                /*!< LEDTS0 LDCMP1: CMP_LD5 (Bitfield-Mask: 0xff)                */
#define LEDTS0_LDCMP1_CMP_LD6_Pos             (16UL)                    /*!< LEDTS0 LDCMP1: CMP_LD6 (Bit 16)                             */
#define LEDTS0_LDCMP1_CMP_LD6_Msk             (0xff0000UL)              /*!< LEDTS0 LDCMP1: CMP_LD6 (Bitfield-Mask: 0xff)                */
#define LEDTS0_LDCMP1_CMP_LDA_TSCOM_Pos       (24UL)                    /*!< LEDTS0 LDCMP1: CMP_LDA_TSCOM (Bit 24)                       */
#define LEDTS0_LDCMP1_CMP_LDA_TSCOM_Msk       (0xff000000UL)            /*!< LEDTS0 LDCMP1: CMP_LDA_TSCOM (Bitfield-Mask: 0xff)          */

/* --------------------------------  LEDTS0_TSCMP0  ------------------------------- */
#define LEDTS0_TSCMP0_CMP_TS0_Pos             (0UL)                     /*!< LEDTS0 TSCMP0: CMP_TS0 (Bit 0)                              */
#define LEDTS0_TSCMP0_CMP_TS0_Msk             (0xffUL)                  /*!< LEDTS0 TSCMP0: CMP_TS0 (Bitfield-Mask: 0xff)                */
#define LEDTS0_TSCMP0_CMP_TS1_Pos             (8UL)                     /*!< LEDTS0 TSCMP0: CMP_TS1 (Bit 8)                              */
#define LEDTS0_TSCMP0_CMP_TS1_Msk             (0xff00UL)                /*!< LEDTS0 TSCMP0: CMP_TS1 (Bitfield-Mask: 0xff)                */
#define LEDTS0_TSCMP0_CMP_TS2_Pos             (16UL)                    /*!< LEDTS0 TSCMP0: CMP_TS2 (Bit 16)                             */
#define LEDTS0_TSCMP0_CMP_TS2_Msk             (0xff0000UL)              /*!< LEDTS0 TSCMP0: CMP_TS2 (Bitfield-Mask: 0xff)                */
#define LEDTS0_TSCMP0_CMP_TS3_Pos             (24UL)                    /*!< LEDTS0 TSCMP0: CMP_TS3 (Bit 24)                             */
#define LEDTS0_TSCMP0_CMP_TS3_Msk             (0xff000000UL)            /*!< LEDTS0 TSCMP0: CMP_TS3 (Bitfield-Mask: 0xff)                */

