Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Infineon/XMC1400_series/Include/XMC1403.h
/* -----------------------------------  BCCU_ID  ---------------------------------- */
#define BCCU_ID_MOD_REV_Pos                   (0UL)                     /*!< BCCU ID: MOD_REV (Bit 0)                                    */
#define BCCU_ID_MOD_REV_Msk                   (0xffUL)                  /*!< BCCU ID: MOD_REV (Bitfield-Mask: 0xff)                      */
#define BCCU_ID_MOD_TYPE0_Pos                 (8UL)                     /*!< BCCU ID: MOD_TYPE0 (Bit 8)                                  */
#define BCCU_ID_MOD_TYPE0_Msk                 (0xff00UL)                /*!< BCCU ID: MOD_TYPE0 (Bitfield-Mask: 0xff)                    */
#define BCCU_ID_MOD_NUMBER_Pos                (16UL)                    /*!< BCCU ID: MOD_NUMBER (Bit 16)                                */
#define BCCU_ID_MOD_NUMBER_Msk                (0xffff0000UL)            /*!< BCCU ID: MOD_NUMBER (Bitfield-Mask: 0xffff)                 */

/* ----------------------------------  BCCU_CHEN  --------------------------------- */
#define BCCU_CHEN_ECH0_Pos                    (0UL)                     /*!< BCCU CHEN: ECH0 (Bit 0)                                     */
#define BCCU_CHEN_ECH0_Msk                    (0x1UL)                   /*!< BCCU CHEN: ECH0 (Bitfield-Mask: 0x01)                       */
#define BCCU_CHEN_ECH1_Pos                    (1UL)                     /*!< BCCU CHEN: ECH1 (Bit 1)                                     */
#define BCCU_CHEN_ECH1_Msk                    (0x2UL)                   /*!< BCCU CHEN: ECH1 (Bitfield-Mask: 0x01)                       */
#define BCCU_CHEN_ECH2_Pos                    (2UL)                     /*!< BCCU CHEN: ECH2 (Bit 2)                                     */
#define BCCU_CHEN_ECH2_Msk                    (0x4UL)                   /*!< BCCU CHEN: ECH2 (Bitfield-Mask: 0x01)                       */
#define BCCU_CHEN_ECH3_Pos                    (3UL)                     /*!< BCCU CHEN: ECH3 (Bit 3)                                     */
#define BCCU_CHEN_ECH3_Msk                    (0x8UL)                   /*!< BCCU CHEN: ECH3 (Bitfield-Mask: 0x01)                       */
#define BCCU_CHEN_ECH4_Pos                    (4UL)                     /*!< BCCU CHEN: ECH4 (Bit 4)                                     */
#define BCCU_CHEN_ECH4_Msk                    (0x10UL)                  /*!< BCCU CHEN: ECH4 (Bitfield-Mask: 0x01)                       */
#define BCCU_CHEN_ECH5_Pos                    (5UL)                     /*!< BCCU CHEN: ECH5 (Bit 5)                                     */
#define BCCU_CHEN_ECH5_Msk                    (0x20UL)                  /*!< BCCU CHEN: ECH5 (Bitfield-Mask: 0x01)                       */
#define BCCU_CHEN_ECH6_Pos                    (6UL)                     /*!< BCCU CHEN: ECH6 (Bit 6)                                     */
#define BCCU_CHEN_ECH6_Msk                    (0x40UL)                  /*!< BCCU CHEN: ECH6 (Bitfield-Mask: 0x01)                       */
#define BCCU_CHEN_ECH7_Pos                    (7UL)                     /*!< BCCU CHEN: ECH7 (Bit 7)                                     */
#define BCCU_CHEN_ECH7_Msk                    (0x80UL)                  /*!< BCCU CHEN: ECH7 (Bitfield-Mask: 0x01)                       */
#define BCCU_CHEN_ECH8_Pos                    (8UL)                     /*!< BCCU CHEN: ECH8 (Bit 8)                                     */
#define BCCU_CHEN_ECH8_Msk                    (0x100UL)                 /*!< BCCU CHEN: ECH8 (Bitfield-Mask: 0x01)                       */

/* ---------------------------------  BCCU_CHOCON  -------------------------------- */
#define BCCU_CHOCON_CH0OP_Pos                 (0UL)                     /*!< BCCU CHOCON: CH0OP (Bit 0)                                  */
#define BCCU_CHOCON_CH0OP_Msk                 (0x1UL)                   /*!< BCCU CHOCON: CH0OP (Bitfield-Mask: 0x01)                    */
#define BCCU_CHOCON_CH1OP_Pos                 (1UL)                     /*!< BCCU CHOCON: CH1OP (Bit 1)                                  */
#define BCCU_CHOCON_CH1OP_Msk                 (0x2UL)                   /*!< BCCU CHOCON: CH1OP (Bitfield-Mask: 0x01)                    */
#define BCCU_CHOCON_CH2OP_Pos                 (2UL)                     /*!< BCCU CHOCON: CH2OP (Bit 2)                                  */
#define BCCU_CHOCON_CH2OP_Msk                 (0x4UL)                   /*!< BCCU CHOCON: CH2OP (Bitfield-Mask: 0x01)                    */
#define BCCU_CHOCON_CH3OP_Pos                 (3UL)                     /*!< BCCU CHOCON: CH3OP (Bit 3)                                  */
#define BCCU_CHOCON_CH3OP_Msk                 (0x8UL)                   /*!< BCCU CHOCON: CH3OP (Bitfield-Mask: 0x01)                    */
#define BCCU_CHOCON_CH4OP_Pos                 (4UL)                     /*!< BCCU CHOCON: CH4OP (Bit 4)                                  */
#define BCCU_CHOCON_CH4OP_Msk                 (0x10UL)                  /*!< BCCU CHOCON: CH4OP (Bitfield-Mask: 0x01)                    */
#define BCCU_CHOCON_CH5OP_Pos                 (5UL)                     /*!< BCCU CHOCON: CH5OP (Bit 5)                                  */
#define BCCU_CHOCON_CH5OP_Msk                 (0x20UL)                  /*!< BCCU CHOCON: CH5OP (Bitfield-Mask: 0x01)                    */
#define BCCU_CHOCON_CH6OP_Pos                 (6UL)                     /*!< BCCU CHOCON: CH6OP (Bit 6)                                  */
#define BCCU_CHOCON_CH6OP_Msk                 (0x40UL)                  /*!< BCCU CHOCON: CH6OP (Bitfield-Mask: 0x01)                    */
#define BCCU_CHOCON_CH7OP_Pos                 (7UL)                     /*!< BCCU CHOCON: CH7OP (Bit 7)                                  */
#define BCCU_CHOCON_CH7OP_Msk                 (0x80UL)                  /*!< BCCU CHOCON: CH7OP (Bitfield-Mask: 0x01)                    */
#define BCCU_CHOCON_CH8OP_Pos                 (8UL)                     /*!< BCCU CHOCON: CH8OP (Bit 8)                                  */
#define BCCU_CHOCON_CH8OP_Msk                 (0x100UL)                 /*!< BCCU CHOCON: CH8OP (Bitfield-Mask: 0x01)                    */
#define BCCU_CHOCON_CH0TPE_Pos                (16UL)                    /*!< BCCU CHOCON: CH0TPE (Bit 16)                                */
#define BCCU_CHOCON_CH0TPE_Msk                (0x10000UL)               /*!< BCCU CHOCON: CH0TPE (Bitfield-Mask: 0x01)                   */
#define BCCU_CHOCON_CH1TPE_Pos                (17UL)                    /*!< BCCU CHOCON: CH1TPE (Bit 17)                                */
#define BCCU_CHOCON_CH1TPE_Msk                (0x20000UL)               /*!< BCCU CHOCON: CH1TPE (Bitfield-Mask: 0x01)                   */
#define BCCU_CHOCON_CH2TPE_Pos                (18UL)                    /*!< BCCU CHOCON: CH2TPE (Bit 18)                                */
#define BCCU_CHOCON_CH2TPE_Msk                (0x40000UL)               /*!< BCCU CHOCON: CH2TPE (Bitfield-Mask: 0x01)                   */
#define BCCU_CHOCON_CH3TPE_Pos                (19UL)                    /*!< BCCU CHOCON: CH3TPE (Bit 19)                                */
#define BCCU_CHOCON_CH3TPE_Msk                (0x80000UL)               /*!< BCCU CHOCON: CH3TPE (Bitfield-Mask: 0x01)                   */
#define BCCU_CHOCON_CH4TPE_Pos                (20UL)                    /*!< BCCU CHOCON: CH4TPE (Bit 20)                                */
#define BCCU_CHOCON_CH4TPE_Msk                (0x100000UL)              /*!< BCCU CHOCON: CH4TPE (Bitfield-Mask: 0x01)                   */
#define BCCU_CHOCON_CH5TPE_Pos                (21UL)                    /*!< BCCU CHOCON: CH5TPE (Bit 21)                                */
#define BCCU_CHOCON_CH5TPE_Msk                (0x200000UL)              /*!< BCCU CHOCON: CH5TPE (Bitfield-Mask: 0x01)                   */
#define BCCU_CHOCON_CH6TPE_Pos                (22UL)                    /*!< BCCU CHOCON: CH6TPE (Bit 22)                                */
#define BCCU_CHOCON_CH6TPE_Msk                (0x400000UL)              /*!< BCCU CHOCON: CH6TPE (Bitfield-Mask: 0x01)                   */
#define BCCU_CHOCON_CH7TPE_Pos                (23UL)                    /*!< BCCU CHOCON: CH7TPE (Bit 23)                                */
#define BCCU_CHOCON_CH7TPE_Msk                (0x800000UL)              /*!< BCCU CHOCON: CH7TPE (Bitfield-Mask: 0x01)                   */
#define BCCU_CHOCON_CH8TPE_Pos                (24UL)                    /*!< BCCU CHOCON: CH8TPE (Bit 24)                                */
#define BCCU_CHOCON_CH8TPE_Msk                (0x1000000UL)             /*!< BCCU CHOCON: CH8TPE (Bitfield-Mask: 0x01)                   */

/* ---------------------------------  BCCU_CHTRIG  -------------------------------- */
#define BCCU_CHTRIG_ET0_Pos                   (0UL)                     /*!< BCCU CHTRIG: ET0 (Bit 0)                                    */
#define BCCU_CHTRIG_ET0_Msk                   (0x1UL)                   /*!< BCCU CHTRIG: ET0 (Bitfield-Mask: 0x01)                      */
#define BCCU_CHTRIG_ET1_Pos                   (1UL)                     /*!< BCCU CHTRIG: ET1 (Bit 1)                                    */
#define BCCU_CHTRIG_ET1_Msk                   (0x2UL)                   /*!< BCCU CHTRIG: ET1 (Bitfield-Mask: 0x01)                      */
#define BCCU_CHTRIG_ET2_Pos                   (2UL)                     /*!< BCCU CHTRIG: ET2 (Bit 2)                                    */
#define BCCU_CHTRIG_ET2_Msk                   (0x4UL)                   /*!< BCCU CHTRIG: ET2 (Bitfield-Mask: 0x01)                      */
#define BCCU_CHTRIG_ET3_Pos                   (3UL)                     /*!< BCCU CHTRIG: ET3 (Bit 3)                                    */
#define BCCU_CHTRIG_ET3_Msk                   (0x8UL)                   /*!< BCCU CHTRIG: ET3 (Bitfield-Mask: 0x01)                      */
#define BCCU_CHTRIG_ET4_Pos                   (4UL)                     /*!< BCCU CHTRIG: ET4 (Bit 4)                                    */
#define BCCU_CHTRIG_ET4_Msk                   (0x10UL)                  /*!< BCCU CHTRIG: ET4 (Bitfield-Mask: 0x01)                      */
#define BCCU_CHTRIG_ET5_Pos                   (5UL)                     /*!< BCCU CHTRIG: ET5 (Bit 5)                                    */
#define BCCU_CHTRIG_ET5_Msk                   (0x20UL)                  /*!< BCCU CHTRIG: ET5 (Bitfield-Mask: 0x01)                      */
#define BCCU_CHTRIG_ET6_Pos                   (6UL)                     /*!< BCCU CHTRIG: ET6 (Bit 6)                                    */
#define BCCU_CHTRIG_ET6_Msk                   (0x40UL)                  /*!< BCCU CHTRIG: ET6 (Bitfield-Mask: 0x01)                      */
#define BCCU_CHTRIG_ET7_Pos                   (7UL)                     /*!< BCCU CHTRIG: ET7 (Bit 7)                                    */
#define BCCU_CHTRIG_ET7_Msk                   (0x80UL)                  /*!< BCCU CHTRIG: ET7 (Bitfield-Mask: 0x01)                      */
#define BCCU_CHTRIG_ET8_Pos                   (8UL)                     /*!< BCCU CHTRIG: ET8 (Bit 8)                                    */
#define BCCU_CHTRIG_ET8_Msk                   (0x100UL)                 /*!< BCCU CHTRIG: ET8 (Bitfield-Mask: 0x01)                      */
#define BCCU_CHTRIG_TOS0_Pos                  (16UL)                    /*!< BCCU CHTRIG: TOS0 (Bit 16)                                  */
#define BCCU_CHTRIG_TOS0_Msk                  (0x10000UL)               /*!< BCCU CHTRIG: TOS0 (Bitfield-Mask: 0x01)                     */
#define BCCU_CHTRIG_TOS1_Pos                  (17UL)                    /*!< BCCU CHTRIG: TOS1 (Bit 17)                                  */
#define BCCU_CHTRIG_TOS1_Msk                  (0x20000UL)               /*!< BCCU CHTRIG: TOS1 (Bitfield-Mask: 0x01)                     */
#define BCCU_CHTRIG_TOS2_Pos                  (18UL)                    /*!< BCCU CHTRIG: TOS2 (Bit 18)                                  */
#define BCCU_CHTRIG_TOS2_Msk                  (0x40000UL)               /*!< BCCU CHTRIG: TOS2 (Bitfield-Mask: 0x01)                     */
#define BCCU_CHTRIG_TOS3_Pos                  (19UL)                    /*!< BCCU CHTRIG: TOS3 (Bit 19)                                  */
#define BCCU_CHTRIG_TOS3_Msk                  (0x80000UL)               /*!< BCCU CHTRIG: TOS3 (Bitfield-Mask: 0x01)                     */
#define BCCU_CHTRIG_TOS4_Pos                  (20UL)                    /*!< BCCU CHTRIG: TOS4 (Bit 20)                                  */
#define BCCU_CHTRIG_TOS4_Msk                  (0x100000UL)              /*!< BCCU CHTRIG: TOS4 (Bitfield-Mask: 0x01)                     */
#define BCCU_CHTRIG_TOS5_Pos                  (21UL)                    /*!< BCCU CHTRIG: TOS5 (Bit 21)                                  */
#define BCCU_CHTRIG_TOS5_Msk                  (0x200000UL)              /*!< BCCU CHTRIG: TOS5 (Bitfield-Mask: 0x01)                     */
#define BCCU_CHTRIG_TOS6_Pos                  (22UL)                    /*!< BCCU CHTRIG: TOS6 (Bit 22)                                  */
#define BCCU_CHTRIG_TOS6_Msk                  (0x400000UL)              /*!< BCCU CHTRIG: TOS6 (Bitfield-Mask: 0x01)                     */
#define BCCU_CHTRIG_TOS7_Pos                  (23UL)                    /*!< BCCU CHTRIG: TOS7 (Bit 23)                                  */
#define BCCU_CHTRIG_TOS7_Msk                  (0x800000UL)              /*!< BCCU CHTRIG: TOS7 (Bitfield-Mask: 0x01)                     */
#define BCCU_CHTRIG_TOS8_Pos                  (24UL)                    /*!< BCCU CHTRIG: TOS8 (Bit 24)                                  */
#define BCCU_CHTRIG_TOS8_Msk                  (0x1000000UL)             /*!< BCCU CHTRIG: TOS8 (Bitfield-Mask: 0x01)                     */

